[
  {
    "role": "Full Stack Developer Intern",
    "company": "Zen Study",
    "duration": "Dec 2024 - Current",
    "tasks": [
      "Worked on an education platform where educators can stream and upload videos for students.",
      "Embedded DRM-protected Shaka Player to prevent content piracy.",
      "Incorporated live class streaming, automatically storing session recordings on AWS S3."
    ]
  },
  {
    "role":"Full Stack Developer",
    "company":"Mehk Chemicals",
    "duration":"Jan 2025 - Mar 2025",
    "tasks":[
      "Built a CRM for their chemical supply agency",
      "Added analytics and streamlined the order and dispatch process",
      "Integrated supply requirement system to calculate overall production of various chemicals depending on orders",
      "Multiple currency support for the export clients"
    ]
  },
  {
    "role": "Full Stack Developer Intern",
    "company": "33 Solutions",
    "duration": "Nov 2024 - Feb 2025",
    "tasks": [
      "Developed a Bounty Reward Platform to boost sales for 5 businesses.",
      "Built Azure serverless functions to process KERN Seed data for 500+ farmers.",
      "Created a CRM dashboard for Mehek Chemicals, streamlining orders and dispatches for 1,000+ customers and 200+ employees."
    ]
  },
  {
    "role": "President",
    "company": "The CodeBreakers Club",
    "duration": "Sep 2024 - Current",
    "tasks": [
      "Organized workshops and hackathons to enhance coding skills among members.",
      "Collaborated with industry experts to provide mentorship and guidance.",
      "Led a team of 20+ members in various coding competitions and projects."
    ]
  },
  {
    "role": "Content Lead",
    "company": "The CodeBreakers Club",
    "duration": "Sep 2023 - Sep 2024",
    "tasks": [
      "Developed and managed content for the club's website and social media platforms.",
      "Coordinated with team members to create engaging articles and tutorials.",
      "Organized events and workshops to promote coding and technology awareness."
    ]
  },
  {
    "role": "Frontend Developer",
    "company": "Hashtag City",
    "duration": "March 2022 - April 2022",
    "tasks": [
      "Collaborated with the team to design and develop the UI and animations.",
      "Implemented responsive design and ensured cross-browser compatibility.",
      "Participated in code reviews and provided constructive feedback to other developers."
    ]
  }
]
